In [3]:
import pandas as pd
import numpy as np

### Let us initialize an object with a dictionary(json)

In [13]:
river_dict = {'river': ['Missouri', 'Mississippi', 'Yukon', 'Rio Grande', 'Arkansas', 'Salween', 'Lena'],
        'length': [2341, 2202, 1979, 1759, 1450, 1901, 2647],
        'state': ['Montana', 'Minnesota', 'British Columbia', 'Colorado', 'Colorado','China', 'Russia']}

### Converting it to a Panda Dataframe

In [14]:
river_frame = pd.DataFrame(river_dict)

### Viewing content of the Data Frame. Let us start with viewing the entire data frame

In [21]:
river_frame

   length        river             state
0    2341     Missouri           Montana
1    2202  Mississippi         Minnesota
2    1979        Yukon  British Columbia
3    1759   Rio Grande          Colorado
4    1450     Arkansas          Colorado
5    1901      Salween             China
6    2647         Lena            Russia

### Viewing the first five rows

In [16]:
river_frame.head()

   length        river             state
0    2341     Missouri           Montana
1    2202  Mississippi         Minnesota
2    1979        Yukon  British Columbia
3    1759   Rio Grande          Colorado
4    1450     Arkansas          Colorado

### Let us view only the length column

In [27]:
river_frame['length']

0    2341
1    2202
2    1979
3    1759
4    1450
5    1901
6    2647
Name: length, dtype: int64

### If we need to view more than one column, we pass an array on column names

In [30]:
river_frame[['length', 'river']]

   length        river
0    2341     Missouri
1    2202  Mississippi
2    1979        Yukon
3    1759   Rio Grande
4    1450     Arkansas
5    1901      Salween
6    2647         Lena

### Knowing more about the data

In [34]:
river_frame.describe()

            length
count     7.000000
mean   2039.857143
std     394.841077
min    1450.000000
25%    1830.000000
50%    1979.000000
75%    2271.500000
max    2647.000000